core/app/Providers/AppServiceProvider.php

select count(*) as aggregate from `withdrawals` where `status` = 2
select count(*) as aggregate from `deposits` where `status` = 2
select count(*) as aggregate from `sellers` where `status` = 0
select count(*) as aggregate from `users` where `status` = 0
select count(*) as aggregate from `support_tickets` where `status` in (0, 2)
select count(*) as aggregate from `orders` where `status` = 0 and `payment_status` != 0
select count(*) as aggregate from `orders` where `status` = 1 and `payment_status` != 0
select count(*) as aggregate from `orders` where `status` = 2 and `payment_status` != 0
select count(*) as aggregate from `products` where (`status` = 0 and `seller_id` != 0) and `products`.`deleted_at` is null
---
    public function boot()
    {
        $activeTemplate = activeTemplate();
        $general = GeneralSetting::first();
        $viewShare['general'] = $general;
        $viewShare['activeTemplate'] = $activeTemplate;
        $viewShare['activeTemplateTrue'] = activeTemplate(true);
        $viewShare['language'] = Language::all();

        $viewShare['allCategories']= Category::with(['allSubcategories','products'=> function($q){
                return $q->whereHas('categories')->whereHas('brand');
            }, 'products.reviews','products.offer.activeOffer'])
            ->where('parent_id', null)->get();

        view()->share($viewShare);


        view()->composer('admin.partials.sidenav', function ($view) {
            $view->with([
                'banned_users_count'           => User::banned()->count(),
                'email_unverified_users_count' => User::emailUnverified()->count(),
                'sms_unverified_users_count'   => User::smsUnverified()->count(),
                'banned_sellers_count'           => Seller::banned()->count(),
                'email_unverified_sellers_count' => Seller::emailUnverified()->count(),
                'sms_unverified_sellers_count'   => Seller::smsUnverified()->count(),
                'pending_ticket_count'          => SupportTicket::whereIN('status', [0,2])->count(),
                'pending_deposits_count'        => Deposit::pending()->count(),
                'pending_withdraw_count'        => Withdrawal::pending()->count(),
                'pending_product_count'         => Product::pending()->count(),
                'pending_orders_count'          => Order::where('status', 0)->where('payment_status',  '!=' ,0)->count(),
                'processing_orders_count'       => Order::where('status', 1)->where('payment_status','!=', 0)->count(),
                'dispatched_orders_count'       => Order::where('status', 2)->where('payment_status','!=', 0)->count(),
                'seller_pending_product'        => Product::where([['status', 0],['seller_id','!=',0]])
                                                   ->count()

            ]);
        });

select * from `admin_notifications` where `read_status` = 0 order by `id` desc
select * from `users` where `users`.`id` in (1)
---
        });

        view()->composer('admin.partials.topnav', function ($view) {
            $view->with([
                'adminNotifications'=>AdminNotification::where('read_status',0)->with('user', 'seller')->orderBy('id','desc')->get(),
            ]);